inter/withoutExtensionPrefilled/0/blueprints/flowrate/alpha.water.1
    {
        type flowRateWaterAlpha;      // Behaves like zeroGradient with additions to avoid bubbles or rain.
 
        // ADVANCED ENTRIES:
        // pressureThreshold  10000.; // For all boundary cells with pressure p above pressureThreshold alpha.water=1
        //                                         is prescribed. This avoids bubbles in the region with p>pressureThreshold.
        // sharpen              0.01; // Low values increase bubble risk, high values "bend" the water surface
        alphaLowerThreshold  0.001;   // Allow flow for cells with alpha.water < 0.001
        alphaUpperThreshold  0.999;   // Allow flow for cells with alpha.water > 0.999

        value           uniform 0.;
    }
