inter/withoutExtensionPrefilled/0/blueprints/wall_slip/U.1
    {
        type            slip;
    }
