inter/withoutExtensionPrefilled/0/blueprints/wall_slip/nut.1
    {
        type            calculated;
        value           uniform 0;
    }
