inter/withoutExtensionPrefilled/0/blueprints/waterlevel/nut.1
    {
        type            calculated;
        value           uniform 0;
    }
    
