inter/withoutExtensionPrefilled/0/p_rgh
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.e-11;

boundaryField
{
    atmosphere
    {
        type            waterLevel_alpha_prgh;
        mode            singleValue;            // singleValue, ratingCurveTable, ratingCurveFunction or timeSeries  
        data            0.42;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h   

        // MANDATORY FOR INBOUND FLOW:
        // dynamicPressureCorrection  0;        // 0: Water level will not be exact. Level can drop down by up to ~|velocity_height|. Prescribed value is no longer water level, but roughly energy height.
                                                // 1: Apply dynamic pressure correction, to better match the desired water level. Can lead to long waves.
        // dynamicPressureCorrectionRelaxationTime 99; // Relaxation time for dynamic pressure correction to dampen waves (default: endTime/5)
                                                       // Recommended: Set to Eigenperiod of long waves 2*L/sqrt(g*h)

        // OPTIONAL ENTRIES:

        // For slice models:
        // flowRateMultiplier    1.0;           // Multiply Q with flowRateMultiplier before evaluating h 

        // Set pressure level: 
        // refPoint (123. 345. 567.);           // Point in the air, where pressure value is to be prescribed. Defaults to highest point.
        // refValue 0.;                         // Pressure value at refPoint
        
        value           uniform 1.;             // Initial value
    }

    defaultFaces
    {
        type            zeroGradient;
    }

    gate
    {
        type            zeroGradient;
    }

    inlet
    {
        type            waterLevel_alpha_prgh;
        mode            singleValue;            // singleValue, ratingCurveTable, ratingCurveFunction or timeSeries  
        data            0.42;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h   

        // MANDATORY FOR INBOUND FLOW:
           dynamicPressureCorrection  0;        // 0: Water level will not be exact. Level can drop down by up to ~|velocity_height|. Prescribed value is no longer water level, but roughly energy height.
                                                // 1: Apply dynamic pressure correction, to better match the desired water level. Can lead to long waves.
           dynamicPressureCorrectionRelaxationTime 99; // Relaxation time for dynamic pressure correction to dampen waves (default: endTime/5)
                                                       // Recommended: Set to Eigenperiod of long waves 2*L/sqrt(g*h)

        // OPTIONAL ENTRIES:

        // For slice models:
        // flowRateMultiplier    1.0;           // Multiply Q with flowRateMultiplier before evaluating h 

        // Set pressure level: 
        // refPoint (123. 345. 567.);           // Point in the air, where pressure value is to be prescribed. Defaults to highest point.
        // refValue 0.;                         // Pressure value at refPoint
        
        value           uniform 1.;             // Initial value
    }
    lowerWall
    {
        type            zeroGradient;
    }

    outlet
    {
        type            waterLevel_alpha_prgh;
        mode            singleValue;            // singleValue, ratingCurveTable, ratingCurveFunction or timeSeries  
        data            0.326;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h   

        // MANDATORY FOR INBOUND FLOW:
        // dynamicPressureCorrection  0;        // 0: Water level will not be exact. Level can drop down by up to ~|velocity_height|. Prescribed value is no longer water level, but roughly energy height.
                                                // 1: Apply dynamic pressure correction, to better match the desired water level. Can lead to long waves.
        // dynamicPressureCorrectionRelaxationTime 99; // Relaxation time for dynamic pressure correction to dampen waves (default: endTime/5)
                                                       // Recommended: Set to Eigenperiod of long waves 2*L/sqrt(g*h)

        // OPTIONAL ENTRIES:

        // For slice models:
        // flowRateMultiplier    1.0;           // Multiply Q with flowRateMultiplier before evaluating h 

        // Set pressure level: 
        // refPoint (123. 345. 567.);           // Point in the air, where pressure value is to be prescribed. Defaults to highest point.
        // refValue 0.;                         // Pressure value at refPoint
        
        value           uniform 1.;             // Initial value
    }

}
