inter/withoutExtensionPrefilled/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

solvers
{
    "alpha.water.*"
     {
            nAlphaSubCycles 1; //5; //3;              // Sub time steps. Necessary for alpha Courant numbers >> 1.

            MULESCorr       yes;            // Use MULES corrector
            nAlphaCorr      3; //2;              // Number of MULES corrector steps
            nLimiterIter    3; //10;             // Number of iterations allowed for the MULES corrector limiter.
            extremaCoeff    1.;             // Values to be used for the limiter for local extrema. 0.0 allows no local extrema.

            cAlpha          1; //0.5;         // Compression flux coefficient
            icAlpha         0.1;            // Ratio between isotroptic and anisotropic compression flux coefficients
            scAlpha         0.0;            // Additional compression in areas with high shear. Helps at stagnation points.

            solver          smoothSolver;
            smoother        symGaussSeidel;
            tolerance       1.e-08; //1.e-12;
            relTol          0; //1.e-6;
            minIter         2;
    }

    "(pcorr|p_rgh)"
    {
        solver          PBiCGStab;  // GAMG PBiCGStab PCG PPCG PPCR smoothSolver

        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-99;
            relTol          1.e-1;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       1e-99;
        relTol          1.e-1;
        minIter         1; 
        maxIter         50;
    }
    
    "(pcorrFinal|p_rghFinal)"
    {
        solver          PBiCGStab;  // GAMG PBiCGStab PCG PPCG PPCR smoothSolver

        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-99;
            relTol          1.e-2;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        
        tolerance       1e-12;
        relTol          1.e-3;
        minIter         1;
        maxIter         100;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1.e-08;
        relTol          0.01;
        nSweeps         2;
        minIter         1;
        maxIter         20;
    }

    UFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1.e-10;
        relTol          0.001;
        nSweeps         2;
        minIter         1;
        maxIter         20;
    }

    "(k|kFinal|epsilon|epsilonFinal|omega|omegaFinal)"
    {
        solver          GAMG;
        tolerance       1.e-12;
        relTol          1.e-3;
        smoother        DILU;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
        maxIter         20;
    }
}

// fuer interFoam
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3; // Too low values can kill stability
    nNonOrthogonalCorrectors 1;
}

// fuer simpleFoam, scalarTransport
SIMPLE
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    fields
    {  
        p_rgh      0.2; 
        p_rghFinal 1.0;
    } 
    equations
    {
        U      0.7;
        UFinal 1.0;
        "(k|omega)" 0.5;
        "(k|omega)Final" 0.5; 
    }
}

// ************************************************************************* //
